app/controllers/todo_items_controller.rb

SELECT "todo_lists".* FROM "todo_lists" WHERE "todo_lists"."id" = ? LIMIT 1  [["id", "1"]]
---
  def index
  	@todo_list = TodoList.find(params[:todo_list_id])

SELECT "todo_lists".* FROM "todo_lists" WHERE "todo_lists"."id" = ? LIMIT 1  [["id", "1"]]
---
  def new
  	@todo_list = TodoList.find(params[:todo_list_id])

SELECT "todo_lists".* FROM "todo_lists" WHERE "todo_lists"."id" = ? LIMIT 1  [["id", "1"]]
INSERT INTO "todo_items" ("content", "created_at", "todo_list_id", "updated_at") VALUES (?, ?, ?, ?)  [["content", "Milk"], ["created_at", Fri, 21 Feb 2014 00:40:16 UTC +00:00], ["todo_list_id", 1], ["updated_at", Fri, 21 Feb 2014 00:40:16 UTC +00:00]]
---
  def create
  	@todo_list = TodoList.find(params[:todo_list_id])
  	@todo_item = @todo_list.todo_items.new(todo_items_params)
  	if @todo_item.save